var store = [{
        "title": "네트워크 첫 걸음",
        "excerpt":"네트워크를 배우기 앞서 기초지식을 학습한다. 1.1 네트워크의 구조 1.1.1 컴퓨터 네트워크 컴퓨터 간의 네트워크를 연결한 것. 두 대만 연결되어 있어도 네트워크가 되고, 정보를 서로 주고받을 수 있다. 인터넷은 TCP/IP 프로토콜을 기반으로 전 세계적으로 연결되어있는 컴퓨터 네트워크 통신망을 말한다. 1.1.2 패킷 네트워크를 통해 전송되는 작은 데이터 조각 큰 데이터를 그대로 네트워크에...","categories": ["Network"],
        "tags": ["tag1","tag2"],
        "url": "/Network/network1/",
        "teaser": null
      },{
        "title": "네트워크의 기본 규칙",
        "excerpt":"네트워크 통신 규칙인 프로토콜에 대한 설명 2.1 네트워크의 규칙 2.1.1 프로토콜 컴퓨터 또는 전자기기 간의 원활한 통신을 위해 약속한 통신 규약 인터넷은 TCP/IP 프로토콜을 기반으로 전 세계적으로 연결되어있는 컴퓨터 네트워크 통신망을 말한다. 2.2.1 OSI 모델 ISO(국제표준화기구) 에서 정의한 네트워크 기술의 기본이 되는 모델 데이터 송수신은 컴퓨터에서 컴퓨터로 데이터를 전송하는 것....","categories": ["Network"],
        "tags": ["tag1","tag2"],
        "url": "/Network/network2/",
        "teaser": null
      },{
        "title": "관계형 데이터베이스",
        "excerpt":"3.1 관계형 데이터베이스 3.1.1 데이터베이스 데이터란 간단히 말해서 컴퓨터로 어떤 일을 처리할 때 그 대상이 되는 것. 데이터는 그 자체로는 아무런 가치를 가지지 않는다. 가공하여 유용한 정보 를 얻어야 한다. 데이터베이스는 데이터를 일정한 체계에 따라 통합하여 디스크나 메모리에 저장한 것으로 응용프로그램에 종속적이지 않도록 만든 것 데이터베이스는 자료의 독립성, 중복 저장의...","categories": ["Database"],
        "tags": ["tag1","tag2"],
        "url": "/database/sql/3_1",
        "teaser": null
      },{
        "title": "SELECT문 & 함수",
        "excerpt":"SQL문 작성지침 1. 대소문자를 구별하지 않음 SELECT 와 select는 동일하게 인식됨, 가독성을 위해 일반적으로 키워드(SELECT, FROM, WHERE 등)는 대문자로 작성하는 것이 관례 2. 여러 줄에 걸쳐 작성 가능 SQL문은 가독성을 위해 여러 줄에 걸쳐서 작성 가능 3. 키워드는 줄여 쓸수 없다 모든 키워드는 정확하게 작성해야 함 4. 세미콜론(;)으로 끝난다 반드시...","categories": ["Database"],
        "tags": ["tag1","tag2"],
        "url": "/database/sql/3_2",
        "teaser": null
      }]
